Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedSelfweightLoad.Factors Property
 The factors of the decomposed selfweight load.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<double> Factors { get; }
Public ReadOnly Property Factors As List(Of Double)
	Get
Property Value
Type: List<Double>
See Also
Reference
AnalysisDecomposedSelfweightLoad Class
Tekla.Structures.Analysis Namespace